[
    [
        "Responsibilities\n\nKey Responsibilities:\n\nMaintaining development/test environments to perform code fixes/modifications and to test the changes on multiple website platforms prior to the deployment to the production environment. \nDeploying updated versions to the production environment in accordance with the agency change and release management processes. \nMaintaining mobile platform solutions that enables agency to collect and consume real-time data of programs designed to measure services delivery quality via agency survey and assessment tools.\nResolving incident and service request per the Priority Level 2 SLAs for the application and business services support. \nUpdating system documents such as requirements such as Technical Architecture design (TAD and other relevant documents as required annually or upon major changes to architectural environment.\nMaintaining the agency survey applications platforms and deploying updated versions to the production environment in accordance with the approved change and release management processes. \nProviding quarterly maintenance releases to make improvements to deployed solution based on end user feedback and frequently requested functionality or program changes. \nPerforming load and performance testing, per major release and annually, for Priority Level 2 business services. \nCollaborating with team to support mobile solution development and deployment. \nSupporting the update and maintenance of Operations and Maintenace (O&M) plans.\nSupporting application and tool development with a AWS or Azure cloud environment.\n\n*Contingent on Contract Award*\n\nQualifications\n\nBasic Qualification:\n\nU.S. Citizen; eligible for U.S. Secret Security Clearance.\nCompleted BS/BA with 8 - 11 years, or MS with 6 - 9 years, or PhD with 3 -6 years of experience; four (4) years of experience can be substituted in lieu of a bachelor's degree.\nDemonstrated experience developing and implementing web applications.\nWorking knowledge of key Agile processes, techniques, and methodologies such as Scrum and Kanban.\nExperience working in Agile team environment with analysts, developers, testers, production support staff, stakeholders, and external vendor partners.\nUnderstanding of Test-Driven Development (TDD) and experience unit testing their code and performing code reviews.\nExcellent communication skills (written and verbal)\n\nPreferred Qualification:\n\nActive Secret Security Clearance.\nHighly self-motivated and adaptable to learning and understanding new technologies. \nExperience developing within a custom (in-house) and PaaS/SaaS environment.\nExperience with SonarQube for development, continuous integration, and deployment.\n",
        {
            "entities": [
                [
                    53,
                    64,
                    "SKILL"
                ],
                [
                    65,
                    69,
                    "SKILL"
                ],
                [
                    126,
                    130,
                    "SKILL"
                ],
                [
                    335,
                    345,
                    "SKILL"
                ],
                [
                    370,
                    376,
                    "SKILL"
                ],
                [
                    663,
                    670,
                    "SKILL"
                ],
                [
                    738,
                    750,
                    "SKILL"
                ],
                [
                    751,
                    757,
                    "SKILL"
                ],
                [
                    1030,
                    1040,
                    "SKILL"
                ],
                [
                    1364,
                    1371,
                    "SKILL"
                ],
                [
                    1372,
                    1378,
                    "SKILL"
                ],
                [
                    1388,
                    1399,
                    "SKILL"
                ],
                [
                    1529,
                    1540,
                    "SKILL"
                ],
                [
                    1548,
                    1551,
                    "TOOL"
                ],
                [
                    1555,
                    1560,
                    "TOOL"
                ],
                [
                    1561,
                    1566,
                    "SKILL"
                ],
                [
                    1656,
                    1663,
                    "QUALIFICATION"
                ],
                [
                    1690,
                    1698,
                    "SKILL"
                ],
                [
                    1699,
                    1708,
                    "QUALIFICATION"
                ],
                [
                    1720,
                    1722,
                    "QUALIFICATION"
                ],
                [
                    1723,
                    1725,
                    "QUALIFICATION"
                ],
                [
                    1748,
                    1750,
                    "QUALIFICATION"
                ],
                [
                    1772,
                    1775,
                    "QUALIFICATION"
                ],
                [
                    1868,
                    1876,
                    "QUALIFICATION"
                ],
                [
                    1939,
                    1942,
                    "SKILL"
                ],
                [
                    1982,
                    1987,
                    "SKILL"
                ],
                [
                    2037,
                    2042,
                    "SKILL"
                ],
                [
                    2077,
                    2082,
                    "SKILL"
                ],
                [
                    2147,
                    2154,
                    "SKILL"
                ],
                [
                    2223,
                    2227,
                    "SKILL"
                ],
                [
                    2235,
                    2246,
                    "SKILL"
                ],
                [
                    2331,
                    2344,
                    "SKILL"
                ],
                [
                    2414,
                    2422,
                    "SKILL"
                ],
                [
                    2423,
                    2432,
                    "QUALIFICATION"
                ],
                [
                    2625,
                    2636,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "We are seeking an AI Platform Engineer to provide expert knowledge in the realm of AI and ML systems, enabling scientiststs and engineers in pioneering research endeavors. This person will play a key role in ensuring the smooth operation, optimization and performance of our AI-driven products and services for advanced research.\n\nAs An AI Platform Engineer, You Will\n\n Lead the technical development of an emerging enterprise AI inference service. \n Collaborate with researchers and data scientists to deploy machine learning models for enterprise use. \n Optimize AI models, workflows and system performance by conducting analysis and benchmarks to address bottlenecks. \n Operate and enhance software and infrastructure for scalable and reliable AI inference. \n Stay up-to-date with latest advancements in AI inference technologies and best practices. \n\nQualifications\n\nYou meet our minimum qualifications for the job if you...\n\n Hold a Bachelor of Science degree or equivalent years of related professional work experience. \n Have 3+ years scripting and programming skills with Python. \n Have 1+ experience with AI/ML frameworks and libraries such as Tensorflow, PyTorch or MXNet. \n Have 1+ year experience using container-based orchestration (e.g. Kubernetes) and run-time environments (e.g. Docker). \n Solid understanding of inferencing with foundation models including LLMs. \n Demonstrate ability to investigate and resolve moderately complex problems using current job knowledge, research data and external resources. \n Able to work effectively with leadership to prioritize competing tasks. \n Demonstrate solid communication and listening skills within a collaborative team environment. \n Ambitious to learn, effectively plan and organize work, seek and share knowledge on a continuous basis. \n Are able to obtain Secret level security clearance. If selected, you will be subject to a government security clearance investigation and must meet the requirements for access to classified information. Eligibility requirements include U.S. citizenship.You'll go above and beyond our minimum requirements if you... \n\nYou’ll go above and beyond our minimum requirements if you have...\n\n Experience securing Linux/UNIX and Cloud native applications. \n Experience with AI/ML model deployment and management platform (e.g:- MLflow, Kubeflow). \n Have experience with nVidia inferencing technologies including accelerator hardware and Triton inference platform. \n Experience with data management and processing technologies (Apache SPARK, Hadoop). \n Familiarity with cloud computing platform (AWS, Azure or GCP). \n Knowledge of MLOps, Agile and DevOps processes. \n",
        {
            "entities": [
                [
                    18,
                    20,
                    "SKILL"
                ],
                [
                    83,
                    85,
                    "SKILL"
                ],
                [
                    152,
                    160,
                    "SKILL"
                ],
                [
                    275,
                    277,
                    "SKILL"
                ],
                [
                    320,
                    328,
                    "SKILL"
                ],
                [
                    337,
                    339,
                    "SKILL"
                ],
                [
                    389,
                    400,
                    "SKILL"
                ],
                [
                    427,
                    429,
                    "SKILL"
                ],
                [
                    451,
                    462,
                    "SKILL"
                ],
                [
                    510,
                    526,
                    "SKILL"
                ],
                [
                    565,
                    567,
                    "SKILL"
                ],
                [
                    623,
                    631,
                    "SKILL"
                ],
                [
                    747,
                    749,
                    "SKILL"
                ],
                [
                    807,
                    809,
                    "SKILL"
                ],
                [
                    875,
                    879,
                    "TOOL"
                ],
                [
                    938,
                    946,
                    "QUALIFICATION"
                ],
                [
                    1080,
                    1086,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1114,
                    1116,
                    "SKILL"
                ],
                [
                    1251,
                    1261,
                    "SKILL"
                ],
                [
                    1295,
                    1301,
                    "SKILL"
                ],
                [
                    1486,
                    1494,
                    "SKILL"
                ],
                [
                    1618,
                    1631,
                    "SKILL"
                ],
                [
                    1834,
                    1842,
                    "SKILL"
                ],
                [
                    1843,
                    1852,
                    "QUALIFICATION"
                ],
                [
                    1903,
                    1911,
                    "SKILL"
                ],
                [
                    1912,
                    1921,
                    "QUALIFICATION"
                ],
                [
                    1945,
                    1949,
                    "TOOL"
                ],
                [
                    1971,
                    1977,
                    "TOOL"
                ],
                [
                    2062,
                    2064,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2126,
                    2128,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2214,
                    2218,
                    "TOOL"
                ],
                [
                    2223,
                    2228,
                    "SKILL"
                ],
                [
                    2268,
                    2270,
                    "SKILL"
                ],
                [
                    2295,
                    2305,
                    "SKILL"
                ],
                [
                    2481,
                    2491,
                    "SKILL"
                ],
                [
                    2521,
                    2527,
                    "SKILL"
                ],
                [
                    2563,
                    2568,
                    "SKILL"
                ],
                [
                    2589,
                    2592,
                    "TOOL"
                ],
                [
                    2594,
                    2599,
                    "TOOL"
                ],
                [
                    2603,
                    2606,
                    "TOOL"
                ],
                [
                    2631,
                    2636,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "Responsibilities\n\nWhat you'll do\n\nProvide technical leadership on projects and determine plans-of-attack on large projects\nSolve complex architecture challenges and apply architectural standards and start using them on new projects\nBe an advocate across the Atlassian organisation for raising the technical bar and promoting a high technical standard\nPartner across Engineering teams to take on company-wide initiatives\nTransfer your depth of knowledge and share best engineering practices to improve engineering excellence\nMentor the next generation of technical leaders at Atlassian\n\n\nQualifications\n\nYour background\n\nBachelor's or Master's degree (preferably a Computer Science degree or equivalent experience).\n10+ years of experience with Java/Springboot\n10+ years of experience with modern JavaScript/TypeScript frameworks (e.g. React)\n10+ years of experience with relational, noSQL, and graph databases (e.g., SQL Server, MongoDB, GraphQL)\n8+ years of experience in Cloud technologies such as AWS (preferred), Azure, or GCP\nDeep experience in systems engineering at scale with regards to testing, reliability, security, and observability\nDeep experience with GraphQL spec and designing durable schemas\nConsider the customer impact when making technical decisions",
        {
            "entities": [
                [
                    137,
                    149,
                    "SKILL"
                ],
                [
                    620,
                    628,
                    "QUALIFICATION"
                ],
                [
                    634,
                    640,
                    "QUALIFICATION"
                ],
                [
                    744,
                    748,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    796,
                    806,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    807,
                    817,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    917,
                    920,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    973,
                    978,
                    "SKILL"
                ],
                [
                    1000,
                    1003,
                    "TOOL"
                ],
                [
                    1017,
                    1022,
                    "TOOL"
                ],
                [
                    1027,
                    1030,
                    "TOOL"
                ],
                [
                    1117,
                    1125,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "Role Overview:\n\nAs a Level III Software Engineer, you will play a pivotal role in designing, implementing, and improving components that drive our media and physiological credibility assessment platforms. Working closely with a cross-functional team, you'll be responsible for writing code to support end-to-end assessment platforms, including building, testing, optimizing, and implementing containerized components in an AWS Cloud environment.\n\n\nKey Responsibilities:\n\nDesign and develop containerized applications and components in an AWS Cloud environment.\nCollaborate with front end engineers to ensure seamless integration between the frontend and backend components.\nWork with SQL and NOSQL systems to store and process data in containerized applications.\nDesign components and applications to be scalable in an AWS Cloud environment.\nCollaborate with data scientists and machine learning engineers to deploy machine learning applications into a containerized environment.\nEnsure the security and integrity of data through effective implementation of best practices.\nImplement strong unit and integration testing practices\nRobust documentation of code\n\n\nRequired Qualifications:\n\nBachelor's degree in Computer Science.\n5+ years of industry experience as a developer\nProficient with programming in a Linux environment, using terminal and shell commands, and writing bash scripts.\nExperience developing and deploying apps for an AWS cloud environment.\nProficient with SQL and NOSQL database systems\nProficient in one or more of the following programming languages: Python, Java, C/C++, C#, Rust\nExpert in one or more of the following programming languages: Python, Java, C/C++, C#, Rust\nProficient with Docker, creating Docker containers, and creating Docker compose deployments\nProficient with media processing libraries such as OpenCV, MediaPipe, etc.\nExperience developing applications for deployment in serverless architectures\n\n\nPreferred Qualifications:\n\nExperience with AI based media generation or media analysis tools\nFamiliarity with message queues and event-driven architectures\n",
        {
            "entities": [
                [
                    137,
                    142,
                    "TOOL"
                ],
                [
                    234,
                    244,
                    "SKILL"
                ],
                [
                    277,
                    284,
                    "SKILL"
                ],
                [
                    293,
                    300,
                    "SKILL"
                ],
                [
                    423,
                    426,
                    "TOOL"
                ],
                [
                    427,
                    432,
                    "SKILL"
                ],
                [
                    471,
                    477,
                    "SKILL"
                ],
                [
                    538,
                    541,
                    "TOOL"
                ],
                [
                    542,
                    547,
                    "SKILL"
                ],
                [
                    561,
                    572,
                    "SKILL"
                ],
                [
                    641,
                    649,
                    "SKILL"
                ],
                [
                    654,
                    661,
                    "SKILL"
                ],
                [
                    684,
                    687,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    763,
                    769,
                    "SKILL"
                ],
                [
                    819,
                    822,
                    "TOOL"
                ],
                [
                    823,
                    828,
                    "SKILL"
                ],
                [
                    842,
                    853,
                    "SKILL"
                ],
                [
                    879,
                    895,
                    "SKILL"
                ],
                [
                    916,
                    932,
                    "SKILL"
                ],
                [
                    991,
                    999,
                    "SKILL"
                ],
                [
                    1187,
                    1195,
                    "QUALIFICATION"
                ],
                [
                    1344,
                    1349,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1364,
                    1371,
                    "SKILL"
                ],
                [
                    1372,
                    1376,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1434,
                    1437,
                    "TOOL"
                ],
                [
                    1438,
                    1443,
                    "SKILL"
                ],
                [
                    1473,
                    1476,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1570,
                    1576,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1578,
                    1582,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1586,
                    1589,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1591,
                    1593,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1595,
                    1599,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1662,
                    1668,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1670,
                    1674,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1678,
                    1681,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1683,
                    1685,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1687,
                    1691,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1708,
                    1714,
                    "SKILL"
                ],
                [
                    1725,
                    1731,
                    "SKILL"
                ],
                [
                    1757,
                    1763,
                    "SKILL"
                ],
                [
                    1982,
                    1984,
                    "SKILL"
                ],
                [
                    2017,
                    2025,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "What You’ll Do:\n\nCollaborate with and across the whole company to help drive cloud spending down and provide more stable architectures.\n\nShare your passion for staying on top of tech trends, experimenting with and learning new technologies, participating in internal & external technology communities, mentoring other members of the engineering community\n\nCollaborate with digital product managers, and deliver robust cloud-based solutions that are leveraged by leadership and the development community to baseline cloud spend.\n\nUtilize Angular, Python, GO, and Spark for ETL processing as well as resilient internal use applications.\n\nLeverage AWS services such as Lambda, GLUE, Fargate and others to build a low maintenance responsive application\n\nBasic Qualifications: \n\nBachelor’s Degree\n\nAt least 4 years of experience in software engineering (Internship experience does not apply)\n\nPreferred Qualifications:\n\n5+ years of experience in at least one of the following: JavaScript, SQL, Python, or Go\n\n1+ years of experience with AWS, GCP, Microsoft Azure, or another cloud service\n\n3+ years of experience in open source frameworks\n\n2+ years of experience in Agile practices\n\n2+ years of experience in API based software development",
        {
            "entities": [
                [
                    17,
                    28,
                    "SKILL"
                ],
                [
                    71,
                    76,
                    "TOOL"
                ],
                [
                    77,
                    82,
                    "SKILL"
                ],
                [
                    356,
                    367,
                    "SKILL"
                ],
                [
                    418,
                    423,
                    "SKILL"
                ],
                [
                    481,
                    492,
                    "SKILL"
                ],
                [
                    515,
                    520,
                    "SKILL"
                ],
                [
                    546,
                    552,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    554,
                    556,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    645,
                    648,
                    "TOOL"
                ],
                [
                    666,
                    672,
                    "SKILL"
                ],
                [
                    774,
                    782,
                    "QUALIFICATION"
                ],
                [
                    972,
                    982,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    984,
                    987,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    989,
                    995,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1000,
                    1002,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1032,
                    1035,
                    "TOOL"
                ],
                [
                    1037,
                    1040,
                    "TOOL"
                ],
                [
                    1052,
                    1057,
                    "TOOL"
                ],
                [
                    1070,
                    1075,
                    "SKILL"
                ],
                [
                    1161,
                    1166,
                    "SKILL"
                ],
                [
                    1204,
                    1207,
                    "SKILL"
                ],
                [
                    1223,
                    1234,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "Position Description:\n\nOur Senior Engineer is a key member of the engineering staff working on Web solutions ensuring that we provide a friction-less experience to our customers and maintain the highest standards of protection and availability. Our team thrives and succeeds in delivering high quality technology products and services in a hyper-growth environment where priorities shift quickly. The ideal candidate has broad and deep technical knowledge, typically ranging from front-end UIs through back-end systems and all points in between.\n\nPosition Responsibilities\n\nAs a Senior Engineer, you will:\n\n Scope, design, and build scalable, resilient distributed systems \n Build product definition and leverage your technical skills to drive towards the right solution \n Engage in cross-functional collaboration throughout the entire software lifecycle \n Lead in design sessions and code reviews with peers to elevate the quality of engineering across the organization \n Define, create, and support reusable application components/patterns from a business and technology perspective \n Utilize programming languages like JavaScript, TypeScript, Java, C#, Python, Go, and Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services\n Mentor other engineers \n Consistently share best practices and improve processes within and across teams \n Utilizes developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication) to perform advanced-level Mobile/Web/UI design, implementation, and maintenance activities under minimal direction \n\nQualifications:\n\nFluency and specialization with at least two modern languages such as JavaScript, TypeScript, JSX, Java, C++, Python or C# including object-oriented design\nProven understanding of micro-services architecture and extensible REST APIs \n Fluency in DevOps Concepts, Cloud Architecture, and Azure DevOps Operational Framework \n Experience in existing Operational Portals such as Azure Portal \n Experience with application monitoring tools and performance assessments\n Knowledge of security protocols and products: Understanding of Active Directory, Windows Authentication, SAML, OAuth \n In-depth knowledge of CS data structures and algorithms \n Experience with continuous delivery and infrastructure as code \n Experience building the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systems \nExperience in Web Application Frameworks\nExperience in securing web applications \n\nExperience:\n\n4+ years of professional software development experience within Web frameworks/SDKs/languages\n3+ years of experience with architecture and design \n3+ years of experience with AWS, GCP, Azure, or another cloud service \n2+ years of experience in open-source frameworks \n\nEducation:\n\nBachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience\n",
        {
            "entities": [
                [
                    95,
                    98,
                    "SKILL"
                ],
                [
                    615,
                    621,
                    "SKILL"
                ],
                [
                    738,
                    743,
                    "TOOL"
                ],
                [
                    789,
                    799,
                    "SKILL"
                ],
                [
                    800,
                    813,
                    "SKILL"
                ],
                [
                    865,
                    871,
                    "SKILL"
                ],
                [
                    993,
                    1000,
                    "SKILL"
                ],
                [
                    1122,
                    1132,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1134,
                    1144,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1146,
                    1150,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1152,
                    1154,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1156,
                    1162,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1164,
                    1166,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1215,
                    1221,
                    "SKILL"
                ],
                [
                    1226,
                    1236,
                    "SKILL"
                ],
                [
                    1255,
                    1260,
                    "TOOL"
                ],
                [
                    1435,
                    1446,
                    "SKILL"
                ],
                [
                    1464,
                    1474,
                    "SKILL"
                ],
                [
                    1533,
                    1546,
                    "SKILL"
                ],
                [
                    1574,
                    1580,
                    "SKILL"
                ],
                [
                    1581,
                    1584,
                    "SKILL"
                ],
                [
                    1585,
                    1587,
                    "SKILL"
                ],
                [
                    1588,
                    1594,
                    "SKILL"
                ],
                [
                    1752,
                    1762,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1764,
                    1774,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1781,
                    1785,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1787,
                    1790,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1792,
                    1798,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1802,
                    1804,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1815,
                    1830,
                    "SKILL"
                ],
                [
                    1831,
                    1837,
                    "SKILL"
                ],
                [
                    1877,
                    1889,
                    "SKILL"
                ],
                [
                    1945,
                    1950,
                    "SKILL"
                ],
                [
                    1951,
                    1963,
                    "SKILL"
                ],
                [
                    1969,
                    1974,
                    "TOOL"
                ],
                [
                    2057,
                    2062,
                    "TOOL"
                ],
                [
                    2159,
                    2167,
                    "SKILL"
                ],
                [
                    2227,
                    2234,
                    "TOOL"
                ],
                [
                    2235,
                    2249,
                    "SKILL"
                ],
                [
                    2251,
                    2255,
                    "SKILL"
                ],
                [
                    2257,
                    2262,
                    "SKILL"
                ],
                [
                    2412,
                    2424,
                    "SKILL"
                ],
                [
                    2429,
                    2435,
                    "SKILL"
                ],
                [
                    2437,
                    2449,
                    "SKILL"
                ],
                [
                    2451,
                    2457,
                    "SKILL"
                ],
                [
                    2536,
                    2539,
                    "SKILL"
                ],
                [
                    2586,
                    2589,
                    "SKILL"
                ],
                [
                    2652,
                    2663,
                    "SKILL"
                ],
                [
                    2682,
                    2685,
                    "SKILL"
                ],
                [
                    2740,
                    2752,
                    "SKILL"
                ],
                [
                    2757,
                    2763,
                    "SKILL"
                ],
                [
                    2793,
                    2796,
                    "TOOL"
                ],
                [
                    2798,
                    2801,
                    "TOOL"
                ],
                [
                    2803,
                    2808,
                    "TOOL"
                ],
                [
                    2821,
                    2826,
                    "SKILL"
                ],
                [
                    2899,
                    2907,
                    "QUALIFICATION"
                ]
            ]
        }
    ],
    [
        "Description\n\nThe Senior Software Engineer role seeks an individual with over 10 years of experience in software engineering, demonstrating proficiency in XQuery, XSLT, JavaScript, Java, Spring Framework, Angular, and Python. The position involves making significant contributions to the development of new software solutions, as well as optimizing, maintaining, and enhancing existing ones. Responsibilities also include active participation in groundbreaking projects focused on data processing, analytics, machine learning, authentication, and integrations.\n\nThe selected candidate will primarily be responsible for designing and developing applications using MarkLogic technologies, including data modeling, application architecture, and implementation using XQuery and JavaScript. This includes managing databases, developing code artifacts for data manipulation, implementing search capabilities, and ensuring secure application development. Additionally, the role involves designing and maintaining high-quality software solutions using Java, Spring Framework, and Angular, collaborating with cross-functional teams, and integrating analytics tools into the software stack. Utilizing AWS services for building scalable solutions and contributing to exploratory projects focusing on machine learning and generative AI are part of the responsibilities. The candidate will be expected to work independently, meet deadlines, and demonstrate flexibility in balancing priorities effectively. The candidate must showcase continual learning and adopt evolving technology and application development standards, deployment practices and processes, and help APA stay innovative and current.\n\nEducation And Experience Required\n\nEducation: Bachelor’s Degree in Computer Science or related discipline. Advanced degree desirable.\nMinimum of 10 years of professional experience in software engineering.\nProven track record of successful and timely delivery of software development projects with high-quality outcomes.\nExperience in various stages of the software development life cycle, from concept to deployment.\nDemonstrated ability to lead and mentor junior developers.\nExperience in software integration, automated software testing, data management/governance, and business process analysis.\nExcellent analytic problem-solving, anticipation, and critical-thinking skills, with ability to define and solve complex problems.\nExperience and strong background in Agile development methodology and SDLC, DevOps and Lean methodologies.\nDemonstrated on-the-job experience with managing priorities across multiple projects.\nStrong verbal and written communication skills, and ability to communicate key concepts effectively with technical teams and managerial staff.\n\nComputer Skills\n\nProficient in MarkLogic technologies:\nStrong experience in XQuery, and expertise in XSLT for transforming XML documents into other formats like HTML, PDF, or plain text.\nStrong data modeling skills, including the ability to design and manage XML and JSON data structures, are crucial. \nSolid understanding of triples and views, as well as optics and SPARQL for working with semantic data.\nProficiency in using MLCP (MarkLogic Content Pump) for bulk loading and exporting data is important.\nStrong experience on MarkLogic's search and indexing capabilities, including text and structured search, indexing options, and relevance ranking, is essential.\nFamiliarity with Gradle is necessary for building and managing MarkLogic projects efficiently.\nExperience in developing and consuming REST APIs using MarkLogic's built-in REST capabilities.\nProficient in Java programming language:\nStrong understanding of core Java concepts and best practices.\nExperience with multithreading, performance optimization, and memory management.\nFamiliarity with the latest Java features and updates.\nExperience with Spring framework desired.\nHands-on database related experience with SQL Server, AWS Aurora, MySQL, and/or ElastiCache (Redis).\nUnderstanding of database indexing, query optimization, and transaction management.\nExperience with JavaScript, Python and Angular will be desired.\nExperience using modern build and deployment tools such as Jenkins, Docker, etc. Experience in software build/release, continuous integration, and continuous deployment, as well in software automation techniques and tools.\nExperience with Automated unit tests (JUnit, Mockito).\nExperience with DevOps tools and Version Control including experience with Atlassian tools, Jira, Confluence, BitBucket, Git, Subversion. \nKnowledge of AWS cloud computing platform and AWS services such as ECS, EC2, ECR, Fargate, CodeDeploy, Lambda, S3, CloudFront, CloudWatch, and Parameter Store.\nDesired knowledge and understanding of Artificial Intelligence (AI) and Machine learning skills.\n\nResponsibilities\n\nDesign and develop MarkLogic applications, including data modeling, application architecture, and implementation using XQuery, JavaScript, and other MarkLogic technologies.\nCreate and manage MarkLogic databases, including configuring forests, indexes, and other database components for optimal performance and scalability. \nDevelop and maintain XQuery modules, XSLT stylesheets, and other code artifacts for data manipulation, transformation, and querying. \nImplement MarkLogic's search capabilities, including configuring indexes, developing search applications, and optimizing relevance ranking. \nDesign and implement secure MarkLogic applications, including role-based access control, document permissions, and secure content delivery.\nDevelop and expose MarkLogic functionality through REST APIs, following best practices for API design and development.\nDesign, develop, and maintain high-quality software solutions using Java, Spring Framework, and Angular:\nCollaborate with cross-functional teams to gather and analyze requirements.\nDesign scalable and maintainable software architectures.\nWrite clean, efficient, and well-documented code.\nCollaborate with cross-functional teams to design and implement solutions based on data processing and analytics:\nUtilize best practices for data storage, retrieval, and processing.\nIntegrate analytics tools and frameworks into the software stack.\nOptimize data pipelines for performance and scalability.\nUtilize AWS services, including Lambda services(Node JS and Java) and API gateway.\n\nOther Duties As Assigned\n\nProvide frequent updates on tasks assigned and keep communication channels open.\nWork independently, take initiative and be constantly productive to meet deadlines.\nDemonstrate ability to complete a large quantity of work in a short time, and balance priorities with time used.",
        {
            "entities": [
                [
                    168,
                    178,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    180,
                    184,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    217,
                    223,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    287,
                    298,
                    "SKILL"
                ],
                [
                    497,
                    506,
                    "TOOL"
                ],
                [
                    508,
                    524,
                    "SKILL"
                ],
                [
                    526,
                    540,
                    "SKILL"
                ],
                [
                    723,
                    735,
                    "SKILL"
                ],
                [
                    773,
                    783,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    934,
                    945,
                    "SKILL"
                ],
                [
                    1043,
                    1047,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1105,
                    1115,
                    "SKILL"
                ],
                [
                    1139,
                    1148,
                    "TOOL"
                ],
                [
                    1190,
                    1193,
                    "TOOL"
                ],
                [
                    1288,
                    1304,
                    "SKILL"
                ],
                [
                    1320,
                    1322,
                    "SKILL"
                ],
                [
                    1411,
                    1415,
                    "TOOL"
                ],
                [
                    1585,
                    1596,
                    "SKILL"
                ],
                [
                    1733,
                    1741,
                    "QUALIFICATION"
                ],
                [
                    1959,
                    1970,
                    "SKILL"
                ],
                [
                    2053,
                    2064,
                    "SKILL"
                ],
                [
                    2233,
                    2243,
                    "SKILL"
                ],
                [
                    2277,
                    2285,
                    "SKILL"
                ],
                [
                    2454,
                    2459,
                    "SKILL"
                ],
                [
                    2460,
                    2471,
                    "SKILL"
                ],
                [
                    2505,
                    2509,
                    "SKILL"
                ],
                [
                    2637,
                    2650,
                    "SKILL"
                ],
                [
                    2674,
                    2685,
                    "SKILL"
                ],
                [
                    2878,
                    2881,
                    "SKILL"
                ],
                [
                    2916,
                    2920,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2996,
                    3002,
                    "SKILL"
                ],
                [
                    3014,
                    3017,
                    "SKILL"
                ],
                [
                    3022,
                    3026,
                    "SKILL"
                ],
                [
                    3439,
                    3445,
                    "SKILL"
                ],
                [
                    3626,
                    3630,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3682,
                    3686,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3785,
                    3795,
                    "SKILL"
                ],
                [
                    3825,
                    3829,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3936,
                    3939,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3948,
                    3951,
                    "TOOL"
                ],
                [
                    4031,
                    4036,
                    "SKILL"
                ],
                [
                    4067,
                    4077,
                    "SKILL"
                ],
                [
                    4095,
                    4105,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    4107,
                    4113,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    4202,
                    4209,
                    "SKILL"
                ],
                [
                    4211,
                    4217,
                    "SKILL"
                ],
                [
                    4573,
                    4576,
                    "TOOL"
                ],
                [
                    4577,
                    4582,
                    "SKILL"
                ],
                [
                    4606,
                    4609,
                    "TOOL"
                ],
                [
                    4663,
                    4669,
                    "SKILL"
                ],
                [
                    4671,
                    4673,
                    "SKILL"
                ],
                [
                    4759,
                    4782,
                    "SKILL"
                ],
                [
                    4784,
                    4786,
                    "SKILL"
                ],
                [
                    4792,
                    4808,
                    "SKILL"
                ],
                [
                    4836,
                    4842,
                    "SKILL"
                ],
                [
                    4916,
                    4928,
                    "SKILL"
                ],
                [
                    4963,
                    4973,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    5435,
                    5441,
                    "SKILL"
                ],
                [
                    5508,
                    5514,
                    "TOOL"
                ],
                [
                    5666,
                    5669,
                    "SKILL"
                ],
                [
                    5670,
                    5676,
                    "SKILL"
                ],
                [
                    5681,
                    5692,
                    "SKILL"
                ],
                [
                    5694,
                    5700,
                    "SKILL"
                ],
                [
                    5762,
                    5766,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    5799,
                    5810,
                    "SKILL"
                ],
                [
                    5822,
                    5832,
                    "SKILL"
                ],
                [
                    5875,
                    5881,
                    "SKILL"
                ],
                [
                    5982,
                    5993,
                    "SKILL"
                ],
                [
                    6005,
                    6015,
                    "SKILL"
                ],
                [
                    6025,
                    6031,
                    "SKILL"
                ],
                [
                    6085,
                    6094,
                    "TOOL"
                ],
                [
                    6174,
                    6183,
                    "TOOL"
                ],
                [
                    6295,
                    6298,
                    "TOOL"
                ],
                [
                    6319,
                    6325,
                    "SKILL"
                ],
                [
                    6347,
                    6351,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    6357,
                    6360,
                    "SKILL"
                ],
                [
                    6449,
                    6462,
                    "SKILL"
                ],
                [
                    6546,
                    6550,
                    "TOOL"
                ]
            ]
        }
    ],
    [
        "Participate, as part of a research and development team, in the technical development of sensing systems for the US Army, as well as ancillary software necessary to aid teams with rapid prototyping, technical maturation, and research and development efforts. Sensing systems may include electro-optic/infrared (EO/IR), radar threat detection payloads, and many others. Software may include full stack development, software infrastructure and custom toolsets to support development of sensing algorithms, artificial intelligence/machine learning, and data analyses, as well as Augmented Reality implementations, command and control, user interfaces, and many other items dependent on the project.\nEssential Job Duties:\nParticipate in team-based software development, engineering, prototype implementation, real time software implementation, data analysis, image processing, algorithm / aided target recognition development, and/or algorithm evaluations.\nLead development and implementation of an advanced MLOps platform, including front-end and back-end components, as well as integrating hardware elements when necessary.\nInnovate and customize workflows to support CMD's project teams in developing state-of-the-art software-intensive sensing systems for detecting and neutralizing explosive hazards.\nServe as the primary developer, working under the guidance of a designated team lead, to craft and refine project requirements, develop bespoke code solutions, and integrate a mix of in-house and external tools.\nFoster strong collaborative relationships with CMD scientists and engineers, ensuring the platform evolves in alignment with user needs and project objectives.\nLeverage extensive knowledge of modern data storage, processing capabilities, and software tools to support tasks such as image data labeling, truthing, and synthetic data generation.\nContinuously explore and integrate new technologies and methodologies to enhance the platform's capabilities and ensure it remains at the cutting edge.\nWork closely with the Countermine Division project teams to tailor and implement solutions that precisely fit their unique requirements.\nFocus on delivering an initial minimum-viable product, with a commitment to ongoing improvement and adaptation over time. \n\nDesired Skills and Experience\n\n\nExperience and Expertise Required:\nBachelor??s or Master??s degree in Computer Science, Computer Engineering, or a closely related field.\nDemonstrated proficiency in a broad range of technologies, including MongoDB, Docker, Singularity, Kubernetes, Django Web Development, Unreal 4 or 5, Linux, and Windows.\nExpertise in programming languages such as Python, C/C++, with a strong emphasis on developing scalable and robust software solutions.\nExceptional ability to work well both within a team and independently, with a balanced approach to collaborative and solo projects.\nStrong analytical and problem-solving skills, coupled with an innovative mindset and a commitment to excellence.",
        {
            "entities": [
                [
                    26,
                    34,
                    "SKILL"
                ],
                [
                    39,
                    50,
                    "SKILL"
                ],
                [
                    74,
                    85,
                    "SKILL"
                ],
                [
                    225,
                    233,
                    "SKILL"
                ],
                [
                    238,
                    249,
                    "SKILL"
                ],
                [
                    401,
                    412,
                    "SKILL"
                ],
                [
                    461,
                    468,
                    "SKILL"
                ],
                [
                    469,
                    480,
                    "SKILL"
                ],
                [
                    504,
                    527,
                    "SKILL"
                ],
                [
                    528,
                    544,
                    "SKILL"
                ],
                [
                    687,
                    694,
                    "TOOL"
                ],
                [
                    753,
                    764,
                    "SKILL"
                ],
                [
                    845,
                    853,
                    "SKILL"
                ],
                [
                    910,
                    921,
                    "SKILL"
                ],
                [
                    958,
                    969,
                    "SKILL"
                ],
                [
                    1158,
                    1165,
                    "SKILL"
                ],
                [
                    1172,
                    1179,
                    "TOOL"
                ],
                [
                    1408,
                    1415,
                    "TOOL"
                ],
                [
                    1654,
                    1661,
                    "TOOL"
                ],
                [
                    1774,
                    1781,
                    "SKILL"
                ],
                [
                    2053,
                    2060,
                    "TOOL"
                ],
                [
                    2519,
                    2525,
                    "SKILL"
                ],
                [
                    2540,
                    2550,
                    "SKILL"
                ],
                [
                    2559,
                    2562,
                    "SKILL"
                ],
                [
                    2563,
                    2574,
                    "SKILL"
                ],
                [
                    2602,
                    2609,
                    "TOOL"
                ],
                [
                    2654,
                    2660,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2664,
                    2667,
                    "PROGRAMMING_LANGUAGE"
                ]
            ]
        }
    ],
    [
        "Responsibilities\n\nMission: We provide expert, onsite support in research and development of software designed to exploit vulnerabilities of adversary technology, algorithm development, script writing and software utility development, use of multiple programming languages, analysis and reverse engineering of source code, software integration and testing, technical writing and documentation, and lifecycle maintenance of software programs.\n\nWe are interviewing candidates for our Exploit Software Developer roles. These developer roles are critical to the success of our tool development in the support of our customer's application systems.\n\nYou will have the opportunity to:\n\nProvide on-site support in research and development of integration software designed to exploit vulnerabilities of adversary technology, algorithm development, script, light script writing and software utility development, analysis and knowledge of tools needed for reverse engineering of source code, software integration and testing, technical writing and documentation, and lifecycle maintenance of customer software programs.\nDeveloped software to ingest a capability, unpack the tool, remove documentation and guides, and ready the tool for release to infrastructure\nDevelop software using sockets and other network programming concepts to enable communication between software modules. \nMonitors technology trends such as emerging standards for new technology opportunities.\nProvide new functional capabilities and improve existing cyber operations mission systems at a classified level.\nPython, HTML, CSS development and integration of programs onexisting cyber operations mission systems \nPlan, direct, and coordinate all activities associated with creating software across multiple functional areas and products. \nPrioritize and allocates projects, products, and resources with the assistance of architects and managers.\nParticipate in the strategic decisions about technology, definition, and implementation of the software products. \nDemonstrate familiarity with high-level software design, development techniques, test and integration techniques, and possess the ability understand software modules, system, and subsystems documentation.\nPlan, direct, and coordinate activities of a multi-team or cross-functional organization. \nDirect software development projects to include, ensuring that projects are completed on time and according to quality standards, facilitating communication upward and across project team including project status, justifications for variances and technical information. \n\nQualifications\n\n5 years with BS/BA; 3 years with MS/MA; 0 years with PhD or 10 years with no degree\n\nSoftware/OS experience required:\n\nPython\nHTML\nCSS development\nLinux/Unix\nWindows\nAndroid operating systems high level proficiency\n\nSecurity Clearance\n\nActive TS/SCI with poly",
        {
            "entities": [
                [
                    53,
                    60,
                    "SKILL"
                ],
                [
                    64,
                    72,
                    "SKILL"
                ],
                [
                    77,
                    88,
                    "SKILL"
                ],
                [
                    172,
                    183,
                    "SKILL"
                ],
                [
                    192,
                    199,
                    "SKILL"
                ],
                [
                    221,
                    232,
                    "SKILL"
                ],
                [
                    273,
                    281,
                    "SKILL"
                ],
                [
                    366,
                    373,
                    "SKILL"
                ],
                [
                    577,
                    588,
                    "SKILL"
                ],
                [
                    596,
                    603,
                    "SKILL"
                ],
                [
                    695,
                    702,
                    "SKILL"
                ],
                [
                    706,
                    714,
                    "SKILL"
                ],
                [
                    719,
                    730,
                    "SKILL"
                ],
                [
                    826,
                    837,
                    "SKILL"
                ],
                [
                    860,
                    867,
                    "SKILL"
                ],
                [
                    889,
                    900,
                    "SKILL"
                ],
                [
                    902,
                    910,
                    "SKILL"
                ],
                [
                    1025,
                    1032,
                    "SKILL"
                ],
                [
                    1331,
                    1344,
                    "SKILL"
                ],
                [
                    1472,
                    1482,
                    "SKILL"
                ],
                [
                    1573,
                    1579,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1581,
                    1585,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1587,
                    1590,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1591,
                    1602,
                    "SKILL"
                ],
                [
                    1770,
                    1780,
                    "SKILL"
                ],
                [
                    2073,
                    2079,
                    "SKILL"
                ],
                [
                    2081,
                    2092,
                    "SKILL"
                ],
                [
                    2105,
                    2109,
                    "SKILL"
                ],
                [
                    2294,
                    2304,
                    "SKILL"
                ],
                [
                    2336,
                    2347,
                    "SKILL"
                ],
                [
                    2463,
                    2476,
                    "SKILL"
                ],
                [
                    2495,
                    2502,
                    "TOOL"
                ],
                [
                    2518,
                    2525,
                    "TOOL"
                ],
                [
                    2621,
                    2623,
                    "QUALIFICATION"
                ],
                [
                    2624,
                    2626,
                    "QUALIFICATION"
                ],
                [
                    2641,
                    2643,
                    "QUALIFICATION"
                ],
                [
                    2644,
                    2646,
                    "QUALIFICATION"
                ],
                [
                    2661,
                    2664,
                    "QUALIFICATION"
                ],
                [
                    2727,
                    2733,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2734,
                    2738,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2739,
                    2742,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2743,
                    2754,
                    "SKILL"
                ],
                [
                    2761,
                    2765,
                    "TOOL"
                ],
                [
                    2766,
                    2773,
                    "TOOL"
                ],
                [
                    2774,
                    2781,
                    "TOOL"
                ],
                [
                    2824,
                    2832,
                    "SKILL"
                ],
                [
                    2833,
                    2842,
                    "QUALIFICATION"
                ]
            ]
        }
    ],
    [
        "About the role: \n\nAs a Staff Software Engineer, you are a beacon of knowledge and a go-to person for complex challenges. Your role is pivotal in decision-making processes, high-level architecture designs, and setting the course for technical excellence within teams. You're expected to think critically, solve intricate problems, and mentor Senior and below Engineers.\n\nRaft is building a real-time data platform for the Department of Defense (DoD), aimed at enhancing operators' awareness of critical events, including instances like the Chinese balloon and Cessna over the White House incidents. Central to this data platform is the aggregation of real-time data from over 750 sensors. This data is subsequently enriched, rendered queryable, and ultimately presented as a common operational picture to empower operators in making time critical and pertinent decisions. Our system efficiently handles the processing of over a billion events daily, all achieved with millisecond-level latency. Key technologies include Kafka, Kafka Streams, Pinot, Java, Scala, and Kubernetes. Your involvement in this role will encompass hands-on collaboration with a team of accomplished individuals, collectively striving towards excellence.\n\nWhat you will do:\n\n Build data infrastructure and platforms using streaming frameworks such as Apache Kafka, Flink, and Kafka Streams \n Build Extract, Transform, Load (ETL) pipelines to enable comprehensive data operations \n Leverage software engineering principles to architect, develop, and implement large scale streaming applications \n\nWhat we are looking for:\n\n 7+ years of relevant hands-on industry experience \n Experience with building and managing fault-tolerant, data-intensive platforms using popular streaming technologies such as Kafka, Pinot, or Flink \n Experience with large-scale relational and non-relational databases such as PostgreSQL, MySQL, MongoDB, and Elasticsearch to handle low-latency requirements \n Experience in data management including ETL processing, data governance, and data storage \n Experience with building and releasing software in cloud-native environments \n Experience using a variety of package managers/dependency managers including Maven, Gradle, and NPM \n Deep knowledge of software design and architecture patterns \n Ability to obtain a Security+ certification within the first 90 days of employment with Raft \n\nHighly preferred:\n\n Experience with Kubernetes \n Experience with monitoring (i.e. Prometheus, Grafana) and logging (i.e. Fluentbit, Kibana, Loki) solutions in cloud-native environments \n Solid understanding of Helm Charts \n Experience or knowledge of service mesh technologies, such as Istio \n Experience with supporting enterprise Cloud applications or infrastructure \n Experience in automation languages like Python or GoLang \n\nClearance Requirements:\n\n Active Secret clearance \n\nWork Type: \n\n Hybrid - Washington, D.C. \n May require up to 25% on-site \n May require up to 25% travel \n\nSalary Range:\n\n $130,000 - $210,000 \n The determination of compensation is predicated upon a candidate's comprehensive experience, demonstrated skill, and proven abilities \n\nWhat we will offer you: \n\n Highly competitive salary \n Fully covered healthcare, dental, and vision coverage \n 401(k) and company match \n Take as you need PTO + 11 paid holidays \n Education & training benefits \n Annual budget for your tech/gadgets needs \n Monthly box of yummy snacks to eat while doing meaningful work \n Remote, hybrid, and flexible work options \n Team off-site in fun places! \n Generous Referral Bonuses \n And More! ",
        {
            "entities": [
                [
                    84,
                    86,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    183,
                    195,
                    "SKILL"
                ],
                [
                    1019,
                    1024,
                    "SKILL"
                ],
                [
                    1026,
                    1031,
                    "SKILL"
                ],
                [
                    1048,
                    1052,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1054,
                    1059,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1065,
                    1075,
                    "SKILL"
                ],
                [
                    1131,
                    1144,
                    "SKILL"
                ],
                [
                    1324,
                    1330,
                    "SKILL"
                ],
                [
                    1331,
                    1336,
                    "SKILL"
                ],
                [
                    1349,
                    1354,
                    "SKILL"
                ],
                [
                    1772,
                    1777,
                    "SKILL"
                ],
                [
                    1975,
                    1985,
                    "SKILL"
                ],
                [
                    2099,
                    2104,
                    "SKILL"
                ],
                [
                    2204,
                    2209,
                    "SKILL"
                ],
                [
                    2211,
                    2217,
                    "SKILL"
                ],
                [
                    2256,
                    2262,
                    "SKILL"
                ],
                [
                    2267,
                    2279,
                    "SKILL"
                ],
                [
                    2321,
                    2334,
                    "QUALIFICATION"
                ],
                [
                    2422,
                    2432,
                    "SKILL"
                ],
                [
                    2545,
                    2550,
                    "SKILL"
                ],
                [
                    2718,
                    2723,
                    "SKILL"
                ],
                [
                    2797,
                    2803,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2816,
                    2825,
                    "QUALIFICATION"
                ],
                [
                    2856,
                    2865,
                    "QUALIFICATION"
                ],
                [
                    3216,
                    3226,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "Required: \n\n Ability to perform job responsibilities within a hybrid work model that requires US Tax professionals to co-locate in person 2-3 days per week \n3+ years of experience in C# and .NET development (both Web and Windows application development)\nBachelor's Degree\nAbility to travel up to 25%, on average, based on the work you do and the clients and industries/sectors you serve\nOne of the following active accreditations obtained, in process, or willing able to obtain:\nLicensed CPA in state of practice/primary office if eligible to sit for the CPA\nIf not CPA eligible:\nLicensed Attorney\nEnrolled Agent\nTechnology Certifications:\nCertified SAFe® Lean Portfolio Manager\nCertified SAFe® Architect\nCertified SAFe® Agile Software Engineer\nCertified SAFe® Product Owner/Product Manager\nCertified SAFe® Agilist\nCertified SAFe® Advanced Scrum Master\nCertified SAFe® Scrum Master\nCertified SAFe® DevOps Practitioner\nCertified SAFe® Practitioner\nMicrosoft Certified Solutions Developer (MCSD)\nMicrosoft Certified Solutions Expert (MCSE)\nProfessional Scrum Product Owner™ (PSCPO)-SCRUM.org\nProject Management Professional (PMP)\nProgram Management Professional (PgMP)\nCertified Scrum Product Owner (CSPO)\nProfessional Scrum Developer™ (PSD)\nCertified Scrum Developer (CSD)\nQAI Global Institute Certification\nOpen Group Certified Architect (Open CA)\nOpen Group Certified IT Specialist (Open CITS)\nIASA's Certified IT Architect (CITA) (Level F or A)\nAWS Certified Solutions Architect\nMicrosoft Azure\nMicrosoft MCSD Certification\nMCSD: Web Applications\nMCSD: SharePoint\nMCSD: Application Lifecycle Management Solutions Developer\nCertified Secure Software Lifecycle Professional (CSSLP) - (ISC)2\nOracle Certified Professional\nJava: Java EE Enterprise Architect 5+, Java SE 5+ Programmer, Java EE 5+ Web Component Developer\nISTQB (International Software Testing Qualifications Board)\nUX or UX Master Certification\nAlteryx Designer- Advanced Certification\nCertified Information Systems Security Professional (CISSP)\nCertified Secure Software Lifecycle Professional (CSSLP)\nASQ- American Society for Quality - Software Quality Engineer\nSEI - Software Engineering Institute Certification\nLifecycle Management and Advanced Functional Testing Certifications (HP)\nSix Sigma (Green or Black Belt)\nITIL Certification\nOther: Vendor certification for management of implementations (Oracle, SAP, Thomson Reuters, etc.) or relevant industry certification such as Microsoft Certified Solutions Developer (MCSD), AWS (Amazon Web Services or GCP (Google Cloud Platform)\nPreferred:\n\nUnderstanding of object-oriented programming concepts.\nOf relational database design and querying concepts.\nExperience with agile development methodologies and version control concepts.\nAbility to understand business problem(s) being addressed by the project.\nExperience in UiPath, Alteryx, Power Query, Power BI, Power Automate will be a plus.\nExperience with front end development tools and technologies will be a plus\nExperience in SQL and Microsoft SQL Server.\nExperience with Web API, CICD principles and Unit test frameworks (NUnit, MSTest, or others)",
        {
            "entities": [
                [
                    183,
                    185,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    190,
                    194,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    195,
                    206,
                    "SKILL"
                ],
                [
                    213,
                    216,
                    "SKILL"
                ],
                [
                    221,
                    228,
                    "TOOL"
                ],
                [
                    241,
                    252,
                    "SKILL"
                ],
                [
                    254,
                    262,
                    "QUALIFICATION"
                ],
                [
                    521,
                    527,
                    "TOOL"
                ],
                [
                    656,
                    660,
                    "SKILL"
                ],
                [
                    721,
                    726,
                    "SKILL"
                ],
                [
                    840,
                    845,
                    "SKILL"
                ],
                [
                    846,
                    852,
                    "QUALIFICATION"
                ],
                [
                    869,
                    874,
                    "SKILL"
                ],
                [
                    875,
                    881,
                    "QUALIFICATION"
                ],
                [
                    1051,
                    1056,
                    "SKILL"
                ],
                [
                    1090,
                    1097,
                    "TOOL"
                ],
                [
                    1098,
                    1108,
                    "SKILL"
                ],
                [
                    1136,
                    1146,
                    "SKILL"
                ],
                [
                    1177,
                    1182,
                    "SKILL"
                ],
                [
                    1217,
                    1222,
                    "SKILL"
                ],
                [
                    1250,
                    1255,
                    "SKILL"
                ],
                [
                    1293,
                    1306,
                    "QUALIFICATION"
                ],
                [
                    1447,
                    1450,
                    "TOOL"
                ],
                [
                    1491,
                    1496,
                    "TOOL"
                ],
                [
                    1512,
                    1525,
                    "QUALIFICATION"
                ],
                [
                    1532,
                    1535,
                    "SKILL"
                ],
                [
                    1555,
                    1565,
                    "TOOL"
                ],
                [
                    1594,
                    1604,
                    "SKILL"
                ],
                [
                    1721,
                    1725,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1727,
                    1731,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1760,
                    1764,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1783,
                    1787,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1794,
                    1797,
                    "SKILL"
                ],
                [
                    1878,
                    1880,
                    "SKILL"
                ],
                [
                    1884,
                    1886,
                    "SKILL"
                ],
                [
                    1887,
                    1893,
                    "QUALIFICATION"
                ],
                [
                    1894,
                    1907,
                    "QUALIFICATION"
                ],
                [
                    1935,
                    1948,
                    "QUALIFICATION"
                ],
                [
                    1979,
                    1987,
                    "SKILL"
                ],
                [
                    2165,
                    2178,
                    "QUALIFICATION"
                ],
                [
                    2189,
                    2199,
                    "SKILL"
                ],
                [
                    2213,
                    2223,
                    "SKILL"
                ],
                [
                    2289,
                    2302,
                    "QUALIFICATION"
                ],
                [
                    2317,
                    2330,
                    "QUALIFICATION"
                ],
                [
                    2335,
                    2345,
                    "SKILL"
                ],
                [
                    2423,
                    2436,
                    "QUALIFICATION"
                ],
                [
                    2493,
                    2496,
                    "TOOL"
                ],
                [
                    2505,
                    2508,
                    "SKILL"
                ],
                [
                    2521,
                    2524,
                    "TOOL"
                ],
                [
                    2526,
                    2532,
                    "TOOL"
                ],
                [
                    2533,
                    2538,
                    "SKILL"
                ],
                [
                    2578,
                    2593,
                    "SKILL"
                ],
                [
                    2639,
                    2645,
                    "SKILL"
                ],
                [
                    2685,
                    2690,
                    "SKILL"
                ],
                [
                    2691,
                    2702,
                    "SKILL"
                ],
                [
                    2812,
                    2819,
                    "TOOL"
                ],
                [
                    2858,
                    2863,
                    "SKILL"
                ],
                [
                    2932,
                    2943,
                    "SKILL"
                ],
                [
                    2996,
                    2999,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3014,
                    3017,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3042,
                    3045,
                    "SKILL"
                ],
                [
                    3046,
                    3049,
                    "SKILL"
                ],
                [
                    3076,
                    3080,
                    "SKILL"
                ]
            ]
        }
    ],
    [
        "The Opportunity: \n\nAs a full stack developer, you can resolve a problem with a complete end-to-end solution in a fast, agile environment. If you’re looking for the chance to not just develop software, but to create a system that will make a difference, we need you on our team. We’re looking for an experienced developer like you with the skills needed to develop software and systems from vision to production-ready.\n\nThis role is more than just coding. As a senior full stack developer at Booz Allen, you’ll use your passion to master new tools and techniques and identify needed system improvements. You’ll help clients overcome their most difficult challenges using the latest architectural approaches, tools, and technologies. You’ll make sure the solution developed by the team considers the architecture and operating environment, as well as future functionality and enhancements.\n\nWork with us as we shape systems for the better.\n\nJoin us. The world can’t wait.\n\nYou Have: \n\n3+ years of experience developing and implementing full stack end-end solutions using modern tech stack, and modular and loosely coupled components\nExperience working with 3D and XR application development using Unity and Unreal\nExperience working with virtual reality and augment reality development\nExperience using design patterns to build quality production applications for on-prem and cloud deployment\nExperience with OOP language, including C# and Java, JavaScript, React and Angular, SQL, and Python, to build front-end and back-end services using RESTful APIs\nAbility to obtain a security clearance\nBachelor's degree \n\n\nNice If You Have: \n\nExperience using and building cloud services for one of the major CSP, including AWS, Azure, and GCP\nExperience designing and developing SDK and API frameworks\nExperience developing real-time and low-latency solutions\nExperience with source control, including Plastic SCM, Git, or SVN\nExperience with Unity Reflect, Pixyz, Prespective, or MBSE toolsets\nAbility to work on innovative and emerging technologies to solve hard client problems\nAbility to be a team player and work flexibly across multiple teams\nPossession of strong analytical skills and an attention to detail\n\n\nClearance: \n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. \n",
        {
            "entities": [
                [
                    119,
                    124,
                    "SKILL"
                ],
                [
                    530,
                    536,
                    "QUALIFICATION"
                ],
                [
                    798,
                    810,
                    "SKILL"
                ],
                [
                    1177,
                    1188,
                    "SKILL"
                ],
                [
                    1272,
                    1283,
                    "SKILL"
                ],
                [
                    1301,
                    1307,
                    "SKILL"
                ],
                [
                    1374,
                    1379,
                    "SKILL"
                ],
                [
                    1407,
                    1410,
                    "SKILL"
                ],
                [
                    1431,
                    1433,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1438,
                    1442,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1444,
                    1454,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1475,
                    1478,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1484,
                    1490,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1572,
                    1580,
                    "SKILL"
                ],
                [
                    1581,
                    1590,
                    "QUALIFICATION"
                ],
                [
                    1591,
                    1599,
                    "QUALIFICATION"
                ],
                [
                    1662,
                    1667,
                    "SKILL"
                ],
                [
                    1713,
                    1716,
                    "TOOL"
                ],
                [
                    1718,
                    1723,
                    "TOOL"
                ],
                [
                    1729,
                    1732,
                    "TOOL"
                ],
                [
                    1769,
                    1772,
                    "SKILL"
                ],
                [
                    1777,
                    1780,
                    "SKILL"
                ],
                [
                    2207,
                    2216,
                    "QUALIFICATION"
                ],
                [
                    2261,
                    2269,
                    "SKILL"
                ],
                [
                    2300,
                    2304,
                    "TOOL"
                ],
                [
                    2334,
                    2340,
                    "TOOL"
                ]
            ]
        }
    ],
    [
        "WHAT YOU’LL DO\n\nParticipate within a cross functional product team to develop and deploy production quality code for clients\nBuild reusable libraries and software components to accelerate the delivery of client solutions\nDevelop and champion modern software development best practices and concepts to technical audience and business stakeholders\nTake the lead in designing, developing, and documenting full stack application software; evaluating third-party software products for integration as needed\nParticipate in the full software development life cycle including architecture design, writing documentation and unit/integration tests, identifying issues and resolution, writing clean code, conducting code reviews, and mentoring other Engineers\nScope, architect, design, develop, build, and release robust and scalable applications\nTranslate business requirements into technical requirements and implementation details\nComplex systems that are extensible, easy to understand, and self-maintaining.\nIntegration with third-party systems to enable use cases that power business solutions.\nWork closely with web designers and developers to create modern UI/UX web applications.\nDesign and develop standardized application frameworks to support a variety of applications.\nProvide technical guidance to external clients and internal stakeholders in Bain.\nExplore new technical innovations in the application development to further improve performance and modularity.\nAdvise and coach engineering teams on technology stack best practices and operational models to raise their software engineering capabilities.\nIdentify, assess, track and mitigate issues and risks (technical, people and timelines) at multiple levels\nAnticipate bottlenecks, provide escalation management, anticipate and make trade-offs, and balance the business needs versus technical constraints\nTake an active role in ideation processes, alongside consulting and client colleagues, to bring innovative solutions to problems\nLead engagements that help to understand current state of clients’ technical infrastructure, build processes, security needs, etc.\nWork in a collaborative manner with clients’ technical teams to define technical approaches to implementing designed solutions, including new product architecture, data flows and integration strategies, build processes, etc.\nOccasional travel is required\n \n \n ABOUT YOU\n\nBachelor’s in Computer Science or a related technical field; or equivalent work experience\nExperience in an engineering role at a start-up or fast-growing tech company, with a strong track record of increasing mastery and responsibility\n4+ years of experience with web application development\n4+ years of experience with server-side application development\nExperience with building full stack applications\nStrong computer science fundaments in data structures, algorithms, automated testing, object-oriented programming, performance complexity, and implications of computer architecture on software performance.\nStrong interpersonal and communication skills,\nStrong knowledge in designing and maintaining APIs (RESTful, GraphQL, gRPC).\nStrong knowledge in application deployments in the cloud using CI/CD development process.\nKnowledge in DB schema designs.\nAgile development methodology.\nVersion control and git workflows.\nIdeal candidates will also have experience in:\nMasters in Computer Science or a related technical field.\nExperience working with or providing services to enterprise customers (Fortune 500, Global 1000) \nExperience working with React, Node.js or Python\nExperience with PostgreSQL, MongoDB or SQL Server\n4+ years of experience with SQL or NoSQL databases\nExperience working on public cloud environments (AWS, GCP, or Azure), and associated deep understanding of failover, high-availability, and high scalability\n2+ years of experience working with container technologies (Docker, Kubernetes, or Helm)\nMobile development experience preferred\nExperience with UI/UX analytics platforms for engagement analysis (Amplitude, Mixpanel, Google Analytics)\n \nIrrespective of an individual’s specific background, the successful candidate will be: \n\nCollaborative – someone who knows how to work with and through others to drive results and make change happen, as well is customer service orientated\nEntrepreneurial, proactive, and productive - someone who knows how to prioritize what needs to be done and rallies colleagues to get things accomplished; “roll up the sleeves” type of attitude\nBright – both insightful and creative, with strong problem-solving skills and pragmatic, with a practical, “real-world” sense of what is actually “do-able”. Possesses an affinity for data-driven insights to make decisions, and able to harness knowledge and expertise of the best content to support the Practice\nArticulate and compelling in his/her oral and written communication skills; engaging and concise – with interpersonal “presence”; adaptable across executive, technical and Bain audiences\nEnergetic, with drive, enthusiasm, and natural skills in relationship development; well-connected, with an extensive network of potentially relevant relationships\nInspirational Leadership - track record of managing high-performing, service-oriented team members, motivating and developing colleagues above and below their own tenure\nA great colleague and teammate - passionate about the task at hand and fun to be around; someone with whom Bainies and clients go out of their way to work",
        {
            "entities": [
                [
                    43,
                    53,
                    "SKILL"
                ],
                [
                    258,
                    269,
                    "SKILL"
                ],
                [
                    535,
                    546,
                    "SKILL"
                ],
                [
                    568,
                    580,
                    "SKILL"
                ],
                [
                    581,
                    587,
                    "SKILL"
                ],
                [
                    589,
                    596,
                    "SKILL"
                ],
                [
                    674,
                    681,
                    "SKILL"
                ],
                [
                    767,
                    773,
                    "SKILL"
                ],
                [
                    1108,
                    1111,
                    "SKILL"
                ],
                [
                    1154,
                    1156,
                    "SKILL"
                ],
                [
                    1157,
                    1159,
                    "SKILL"
                ],
                [
                    1160,
                    1163,
                    "SKILL"
                ],
                [
                    1178,
                    1184,
                    "SKILL"
                ],
                [
                    1236,
                    1243,
                    "SKILL"
                ],
                [
                    1406,
                    1417,
                    "SKILL"
                ],
                [
                    1758,
                    1768,
                    "SKILL"
                ],
                [
                    1915,
                    1925,
                    "SKILL"
                ],
                [
                    2101,
                    2109,
                    "SKILL"
                ],
                [
                    2272,
                    2284,
                    "SKILL"
                ],
                [
                    2393,
                    2401,
                    "QUALIFICATION"
                ],
                [
                    2658,
                    2661,
                    "SKILL"
                ],
                [
                    2674,
                    2685,
                    "SKILL"
                ],
                [
                    2738,
                    2749,
                    "SKILL"
                ],
                [
                    2885,
                    2900,
                    "SKILL"
                ],
                [
                    2967,
                    2979,
                    "SKILL"
                ],
                [
                    3030,
                    3043,
                    "SKILL"
                ],
                [
                    3180,
                    3185,
                    "SKILL"
                ],
                [
                    3198,
                    3209,
                    "SKILL"
                ],
                [
                    3251,
                    3256,
                    "SKILL"
                ],
                [
                    3257,
                    3268,
                    "SKILL"
                ],
                [
                    3562,
                    3568,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3608,
                    3611,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3647,
                    3650,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3699,
                    3704,
                    "SKILL"
                ],
                [
                    3719,
                    3722,
                    "TOOL"
                ],
                [
                    3724,
                    3727,
                    "TOOL"
                ],
                [
                    3732,
                    3737,
                    "TOOL"
                ],
                [
                    3887,
                    3893,
                    "SKILL"
                ],
                [
                    3895,
                    3905,
                    "SKILL"
                ],
                [
                    3916,
                    3922,
                    "SKILL"
                ],
                [
                    3923,
                    3934,
                    "SKILL"
                ],
                [
                    3972,
                    3974,
                    "SKILL"
                ],
                [
                    3975,
                    3977,
                    "SKILL"
                ],
                [
                    3978,
                    3987,
                    "TOOL"
                ],
                [
                    4013,
                    4021,
                    "SKILL"
                ],
                [
                    4044,
                    4050,
                    "TOOL"
                ],
                [
                    4051,
                    4060,
                    "TOOL"
                ],
                [
                    4226,
                    4231,
                    "TOOL"
                ],
                [
                    4786,
                    4793,
                    "SKILL"
                ],
                [
                    4861,
                    4874,
                    "SKILL"
                ],
                [
                    5010,
                    5015,
                    "TOOL"
                ],
                [
                    5064,
                    5075,
                    "SKILL"
                ],
                [
                    5454,
                    5456,
                    "PROGRAMMING_LANGUAGE"
                ]
            ]
        }
    ],
    [
        "Introduction\n\nAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and Responsibilities\n\nThe MyNavy HR Transformation program is intended to evolve the Navy’s current MyNavy HR support environment from 200+ legacy applications (50+systems) to a cloud-based architecture comprised of five systems: Single Point of Entry (SPOE), Enterprise Customer Relationship Management (eCRM), Navy Personnel and Pay (NP2), Learning Stack (LS), and the Authoritative Data Environment (ADE).\n\nRequired Technical and Professional Expertise\n\n\nAt least 5 years of Integration Development experience\nAt least 3 years of experience with Java and Eclipse\nAt least 3 years of experience with Configuring workstations, Application Migration and Application Modernization\nAt least 3 years of demonstrated leadership experience\nAt least 3 years of experience with Java Agile development process\nDoD Secret Security Clearance\n",
        {
            "entities": [
                [
                    121,
                    127,
                    "SKILL"
                ],
                [
                    132,
                    143,
                    "SKILL"
                ],
                [
                    172,
                    177,
                    "SKILL"
                ],
                [
                    279,
                    284,
                    "TOOL"
                ],
                [
                    422,
                    428,
                    "TOOL"
                ],
                [
                    622,
                    624,
                    "SKILL"
                ],
                [
                    696,
                    698,
                    "SKILL"
                ],
                [
                    699,
                    706,
                    "SKILL"
                ],
                [
                    767,
                    772,
                    "SKILL"
                ],
                [
                    779,
                    791,
                    "SKILL"
                ],
                [
                    882,
                    892,
                    "SKILL"
                ],
                [
                    1079,
                    1090,
                    "SKILL"
                ],
                [
                    1138,
                    1142,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1360,
                    1364,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1365,
                    1370,
                    "SKILL"
                ],
                [
                    1371,
                    1382,
                    "SKILL"
                ],
                [
                    1402,
                    1410,
                    "SKILL"
                ],
                [
                    1411,
                    1420,
                    "QUALIFICATION"
                ]
            ]
        }
    ],
    [
        "Position Responsibilities:\n\nThe Software Engineer's primary responsibility will be contributing to the development and testing of Airbus U.S.'s satellite flight software. This engineer will be involved in the full lifecycle of flight software development, from requirements definition through operations. However, because we are a small team where each person takes on many roles, this engineer will also contribute to mission concept development, in-house modeling and simulation capabilities, and proposal writing. Being at the cutting edge of space technology, we need someone who is eager to learn, grow, and take on new and potentially unfamiliar challenges. There is no shortage of fascinating problems to solve.\nThe Senior Software Engineer will provide autonomous support of complex assignments, under the leadership of the Software Engineering Manager. The Senior Software Engineer will have project and subject matter responsibility and authority.\n Flight Software 40%\n\nUpgrade existing flight software for new missions\nContribute to the development of new satellite flight software for Airbus U.S. satellite platforms\nDevelop in-house tools to analyze flight software performance and assess its compatibility with new mission and conops\nDevelop and execute flight software tests at the unit, module, subsystem, and platform level\nWork with manufacturing engineers to support installation onto the hardware-in-the-loop test environment and eventual flight hardware\nParticipate in anomaly resolution activities and patch existing flight software\nSoftware Integration and Test 40%\n\nDevelop and execute FSW verifications tests using both proprietary satellite digital twin software and a Hardware in the Loop (HIL) FlatSat.\nEstablish and document test methodologies and descriptions to test compliance with Airbus and customer-based requirements.\nDevelop and implement software and tools for ground support equipment to test and validate flight software.\nContribute to document management, including versioning, bug reporting, and test plan documentation.\nOversee and conduct official validation tests.\nSystems Modeling 10%\n\nContribute to the development of systems- and mission-level modeling and simulation tools\nDevelop software models of payloads for ground testing\nSupport development of software model of satellite platform, particularly ensuring accurate representation of the flight software\nAdditional Responsibilities 10%\n\nSupport working groups, both internal and with customers and/or vendors\nSupport proposal writing, new business\nAssess the software impacts of new hardware, conops, and missions\nQualified Experience / Skills / Training:\n\nEducation:\n\nBachelor's degree in STEM (Science, Technical, Engineering, Math) or related scientific areas.\nPreferred: Master's in STEM (Science, Technical, Engineering, Math) or related scientific areas.\nExperience:\n\nA minimum of 9 years with a Bachelor's degree, or 7 years with a Master's degree.\nProven track-record of working with aerospace hardware and/or software systems, starting from conceptual designs and tradeoffs through detailed design, development, manufacture, integration, test, deployment, and operations.\nKnowledge, Skills, Demonstrated Capabilities:\n\nInsatiable curiosity and a demonstrated ability to learn and work independently\nProficiency in C/C++\nExpertise in one or more of the following:Embedded software development\nDevice driver development and software/hardware interfaces\nReal-time operating systems programming, debugging, and testing\nCybersecurity\nGNC algorithms design, analysis, testing, and implementation\nFunctional validation of embedded software on hardware\nSoftware safety assurance\nNetwork topology and configuration\nSimulators: numerical, emulator, and hardware in the loop\nSoftware requirements and configuration management\nTravel Required: Periodic travel (less than 20%) to Airbus U.S. facilities or partner companies. Occasional International travel to collaborate with European Airbus counterparts\nEligibility: US Citizenship\nClearance: Ability to obtain and maintain a Government security clearance is required. Active DoD security clearance at Secret or above is highly desirable\nPhysical Requirements:\n\nVision: able to see and read computer screen and other electronic equipment with screens, able to read documents.\nHearing: able to hear to participate in conversations in person and via teleconference or phone and to hear sounds including safety warnings or alarms.\nEquipment Operation (personal computer, telephone, copies, fax machine, and related office equipment and using electronic identification card to enter building floors and internal doors): able to operate most office and personal electronic equipment.\nCarrying: able to carry documents, electronic equipment and/or supplies up to 40lbs/9kg.\nLifting: able to lift documents, electronic equipment and/or supplies up to 40lbs/9kg.\nSitting: able to sit for long periods of time in meetings, working on computer.\nSquatting / Kneeling: able to occasionally squat or kneel to retrieve or replace items shelved on bottom shelves.\nStanding: able to stand for long periods of time.\nWalking: able to walk through office and outside areas including uneven surfaces.",
        {
            "entities": [
                [
                    103,
                    114,
                    "SKILL"
                ],
                [
                    243,
                    254,
                    "SKILL"
                ],
                [
                    435,
                    446,
                    "SKILL"
                ],
                [
                    508,
                    515,
                    "SKILL"
                ],
                [
                    772,
                    779,
                    "SKILL"
                ],
                [
                    901,
                    908,
                    "TOOL"
                ],
                [
                    1048,
                    1059,
                    "SKILL"
                ],
                [
                    1378,
                    1385,
                    "SKILL"
                ],
                [
                    1429,
                    1433,
                    "SKILL"
                ],
                [
                    1580,
                    1584,
                    "SKILL"
                ],
                [
                    1754,
                    1758,
                    "SKILL"
                ],
                [
                    1793,
                    1797,
                    "SKILL"
                ],
                [
                    1906,
                    1913,
                    "SKILL"
                ],
                [
                    1927,
                    1931,
                    "SKILL"
                ],
                [
                    1985,
                    1995,
                    "SKILL"
                ],
                [
                    2038,
                    2042,
                    "SKILL"
                ],
                [
                    2150,
                    2161,
                    "SKILL"
                ],
                [
                    2277,
                    2284,
                    "SKILL"
                ],
                [
                    2285,
                    2296,
                    "SKILL"
                ],
                [
                    2440,
                    2447,
                    "SKILL"
                ],
                [
                    2512,
                    2519,
                    "SKILL"
                ],
                [
                    2529,
                    2536,
                    "SKILL"
                ],
                [
                    2672,
                    2680,
                    "QUALIFICATION"
                ],
                [
                    2778,
                    2784,
                    "QUALIFICATION"
                ],
                [
                    2905,
                    2913,
                    "QUALIFICATION"
                ],
                [
                    2942,
                    2948,
                    "QUALIFICATION"
                ],
                [
                    3103,
                    3109,
                    "SKILL"
                ],
                [
                    3111,
                    3122,
                    "SKILL"
                ],
                [
                    3150,
                    3154,
                    "SKILL"
                ],
                [
                    3328,
                    3331,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3392,
                    3403,
                    "SKILL"
                ],
                [
                    3418,
                    3429,
                    "SKILL"
                ],
                [
                    3504,
                    3513,
                    "SKILL"
                ],
                [
                    3556,
                    3562,
                    "SKILL"
                ],
                [
                    3564,
                    3572,
                    "SKILL"
                ],
                [
                    3602,
                    3612,
                    "SKILL"
                ],
                [
                    3816,
                    3826,
                    "SKILL"
                ],
                [
                    3959,
                    3970,
                    "SKILL"
                ],
                [
                    4033,
                    4042,
                    "QUALIFICATION"
                ],
                [
                    4088,
                    4096,
                    "SKILL"
                ],
                [
                    4097,
                    4106,
                    "QUALIFICATION"
                ],
                [
                    4131,
                    4139,
                    "SKILL"
                ],
                [
                    4140,
                    4149,
                    "QUALIFICATION"
                ],
                [
                    4563,
                    4569,
                    "TOOL"
                ],
                [
                    4688,
                    4694,
                    "TOOL"
                ],
                [
                    5180,
                    5186,
                    "TOOL"
                ]
            ]
        }
    ],
    [
        "About The Role\n\nPlanet’s Professional Services team helps our Government customers adopt the Planet Platform and rapidly realize return on investment in Planet data and analytics. The Professional Services Federal team is looking for a Solutions Engineer responsible for the implementation, integration, and analysis of new software and data products that extend the Planet Platform and deliver new capabilities to our federal customers. In this role, you will work with multiple internal teams to develop scripts and analyze data products for delivery to end users. You work will be highly visible, directly impacting customers' ability to quickly access Planet's unprecedented datasets, as well as streamline the internal processes for adding new customers to our platform.\n\nImpact You’ll Own\n\nBuild and maintain APIs which serve our enterprise and federal customers\nUnderstanding client’s needs and delivering tailored solutions\nHelp define, create and analyze usage metrics to drive customer growth\nLeverage analytical skills to deliver products to our federal customers and support mission requirements\nParticipate in team on-call rotation to support production services\n\nWhat You Bring\n\nComputer science, software/systems engineering or related degree with 5+ years in supporting DoD/IC customers including: specialized, relevant technical experience in the general areas of systems integration and intelligence analysis\n4-6+ years industry experience working in the DoD/IC space\nFluent in Golang, Python, Postgresql, & React or related technologies\nExperience with cloud deployments; GCP, AWS, Azure\nExperience designing and evolving public-facing APIs\nExperience with solving complex problems through analytical skills\nExperience scaling and maintaining production systems\n\nWhat Makes You Stand Out\n\nCurrent TS/SCI Clearance\nGEOINT experience, imagery exploitation and analysis\nExperience in Multi-Domain/Multi-Level Security architectures is highly desired\nSystems integrations experience working with multi domain/multi level security architectures with the USG, particularly the DoD/IC\nWorking knowledge of JavaScript and its mapping libraries (OpenLayers, Leaflet, ArcGIS API for JavaScript), Google Earth Engine and its SDK\nExperience with RDBMS (PostgreSQL, SQL) and distributed databases (NoSQL)\nExperience in geopolitics and data science is a plus\nProven ability to pick up new technologies quickly\nExperience with building analytical products from complex datasets\nExperience with geospatial technologies and data\nExcitement about Planet’s mission\n\nBenefits While Working At Planet\n\nComprehensive Health Plan\nWellness program and onsite massages in specific offices\nFlexible Time Off\nRecognition Programs\nCommuter Benefits\nLearning and Tuition Reimbursement\nParental Leave\nOffsites and Happy Hours\nVolunteering Benefits",
        {
            "entities": [
                [
                    169,
                    178,
                    "TOOL"
                ],
                [
                    308,
                    316,
                    "SKILL"
                ],
                [
                    649,
                    655,
                    "TOOL"
                ],
                [
                    981,
                    986,
                    "TOOL"
                ],
                [
                    1079,
                    1086,
                    "SKILL"
                ],
                [
                    1148,
                    1155,
                    "SKILL"
                ],
                [
                    1418,
                    1426,
                    "SKILL"
                ],
                [
                    1504,
                    1510,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1572,
                    1577,
                    "SKILL"
                ],
                [
                    1591,
                    1594,
                    "TOOL"
                ],
                [
                    1596,
                    1599,
                    "TOOL"
                ],
                [
                    1601,
                    1606,
                    "TOOL"
                ],
                [
                    1823,
                    1832,
                    "QUALIFICATION"
                ],
                [
                    1877,
                    1885,
                    "SKILL"
                ],
                [
                    1925,
                    1933,
                    "SKILL"
                ],
                [
                    2036,
                    2044,
                    "SKILL"
                ],
                [
                    2118,
                    2128,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2184,
                    2187,
                    "SKILL"
                ],
                [
                    2192,
                    2202,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2205,
                    2211,
                    "TOOL"
                ],
                [
                    2233,
                    2236,
                    "SKILL"
                ],
                [
                    2272,
                    2275,
                    "PROGRAMMING_LANGUAGE"
                ]
            ]
        }
    ],
    [
        "As Senior Software Developer, you’ll provides subject matter expertise to the team and the customer for all things development with the goal to make an impact across the federal government.\n\nWe know that you can’t have great technology services without amazing people. At MetroStar, we are obsessed with our people and have led a two-decade legacy of building the best and brightest teams. Because we know our future relies on our deep understanding and relentless focus on our people, we live by our mission: A passion for our people. Value for our customers.\n\nIf you think you can see yourself delivering our mission and pursuing our goals with us, then check out the job description below!\n\nWhat you’ll do:\n\nProvide subject matter expertise, in regard to development, to the team and the customer\nResearch, design, test, evaluate, and implement technologies related to Kubernetes, containerization and other infrastructures\nWork on the core platform to create and optimize all functions needed to establish a strong platform infrastructure\nCollaborates with the team and the customer daily\n\nWhat you’ll need to succeed:\n\nMinimum of 8 years of experience as a software developer or engineer \nMinimum of 3 years' experience with Infrastructure as Code (IaC), containerization, K8, and CI/CD Automation\nA bachelor's degree and an active TS/SCI security clearance \nExperience with software development languages such as .NET, Java, Python, and Go; as well as experience working in a DevSecOps environment.\nExperience working with Source Code repositories and CI/CD pipeline solutions such as Team Foundation Server/Azure DevOps, Bitbucket, and GitHub\nExperience with container orchestration tools (Rancher, OpenShift, etc.)\nAbility to work well on a team as well as individually\nAbility to work in downtown Washington, DC on client-site 5 days per week.\n\nLike we said, we are big fans of our people. That’s why we offer a generous benefits package, professional growth, and valuable time to recharge. Learn more about our company culture code and benefits. Plus, check out our accolades.\n",
        {
            "entities": [
                [
                    115,
                    126,
                    "SKILL"
                ],
                [
                    758,
                    769,
                    "SKILL"
                ],
                [
                    800,
                    808,
                    "SKILL"
                ],
                [
                    810,
                    816,
                    "SKILL"
                ],
                [
                    818,
                    822,
                    "SKILL"
                ],
                [
                    872,
                    882,
                    "SKILL"
                ],
                [
                    1305,
                    1313,
                    "QUALIFICATION"
                ],
                [
                    1344,
                    1352,
                    "SKILL"
                ],
                [
                    1353,
                    1362,
                    "QUALIFICATION"
                ],
                [
                    1389,
                    1400,
                    "SKILL"
                ],
                [
                    1419,
                    1423,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1425,
                    1429,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1431,
                    1437,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1443,
                    1445,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1614,
                    1619,
                    "TOOL"
                ]
            ]
        }
    ],
    [
        "Introduction\n\nAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nYour Role and Responsibilities\n\nThe MyNavy HR Transformation program is intended to evolve the Navy’s current MyNavy HR support environment from 200+ legacy applications (50+systems) to a cloud-based architecture comprised of five systems: Single Point of Entry (SPOE), Enterprise Customer Relationship Management (eCRM), Navy Personnel and Pay (NP2), Learning Stack (LS), and the Authoritative Data Environment (ADE).\n\nRequired Technical and Professional Expertise\n\n\nAt least 5 years of Integration Development experience\nAt least 3 years of experience with Java and Eclipse\nAt least 3 years of experience with Configuring workstations, Application Migration and Application Modernization\nAt least 3 years of demonstrated leadership experience\nAt least 3 years of experience with Java Agile development process\nDoD Secret Security Clearance\n\n\nPreferred Technical And Professional Expertise\n\n\nPrior Navy ADE Experience\n",
        {
            "entities": [
                [
                    121,
                    127,
                    "SKILL"
                ],
                [
                    132,
                    143,
                    "SKILL"
                ],
                [
                    172,
                    177,
                    "SKILL"
                ],
                [
                    279,
                    284,
                    "TOOL"
                ],
                [
                    422,
                    428,
                    "TOOL"
                ],
                [
                    622,
                    624,
                    "SKILL"
                ],
                [
                    696,
                    698,
                    "SKILL"
                ],
                [
                    699,
                    706,
                    "SKILL"
                ],
                [
                    767,
                    772,
                    "SKILL"
                ],
                [
                    779,
                    791,
                    "SKILL"
                ],
                [
                    882,
                    892,
                    "SKILL"
                ],
                [
                    1079,
                    1090,
                    "SKILL"
                ],
                [
                    1138,
                    1142,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1360,
                    1364,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1365,
                    1370,
                    "SKILL"
                ],
                [
                    1371,
                    1382,
                    "SKILL"
                ],
                [
                    1402,
                    1410,
                    "SKILL"
                ],
                [
                    1411,
                    1420,
                    "QUALIFICATION"
                ]
            ]
        }
    ],
    [
        "What You Will Be Doing\n\nWork closely with cyber personnel to understand manual analytic processes that are used to assist in the automation of those processes\nCreate automated analytic capability sets (e.g., signature, behavioral, heuristic, anomalous, unsupervised-learning, predictive, and emerging)\nDevelop new platforms to elicit operational effect\nSupport the design, development, and deployment of production systems adhering to the Continuous Integration/Continuous Delivery (CI/CD) pipeline\nProvide post-deployment support of continuous analysis through the full lifecycle of the capabilities\nPerform functions associated with the analysis of information--refining analytics and countermeasure selection, reviewing output, and making upgrades/improvements to the performance of the analytics and countermeasures.\n\nWhat You Must Have\n\nBachelor’s degree with 12+ years of experience in software development OR master’s degree with 10+ years of experience in software development\nUS Citizenship required (required by federal government for position). Security clearance required.\n\nAdditional Skills\n\n3 years of Python development experience\n3 years of development experience in AWS serverless architecture\n1 year of experience in federal cybersecurity requirements\n1 year of experience in analytics (e.g., file, network, host-based, etc.).\n\nPreferred Qualifications\n\nInterpersonal skills and the ability to communicate effectively with various clients in order to explain and elaborate on technical details\nExperience within some or all of these capability areas: Intrusion Detection, Analytics, Information Sharing, Intrusion Prevention, Core Infrastructure\nExperience with developing applications running on Big Data platforms such as Hadoop/Cloudera or Spark, Databricks, PowerBI\nExperience developing advanced dashboards (e.g., Kibana, Splunk, etc.)\nExperience with shell scripting using Bash, PowerShell, or equivalent\nExperience with network monitoring tools such as Wireshark, tcpdump, Zeek, SiLK, or YAF\nExperience within Cloud environments in or using technologies provided by AWS, Google, or Azure\nExperience with Linux operating system\nExperience with monitoring/diagnosing activity at the host, application, network, Internet protocol, database, source code, and LAN layers or other areas preferred\nExperience in analytics associated with analyzing databases, source code, hosts, middleware, application, Local Area Network (LAN), and Internet networks across Open System Interconnect (OSI) model\nExperience in developing real- or near real-time automation\nScaled Agile Framework (SAFe) experience\nAWS certification (Developer, DevOps, and/or Application Architect, etc.)\nCompTIA Advanced Security Practitioner (CASP+) or higher certification level preferred\n",
        {
            "entities": [
                [
                    353,
                    360,
                    "SKILL"
                ],
                [
                    365,
                    371,
                    "SKILL"
                ],
                [
                    373,
                    384,
                    "SKILL"
                ],
                [
                    523,
                    530,
                    "SKILL"
                ],
                [
                    545,
                    553,
                    "SKILL"
                ],
                [
                    639,
                    647,
                    "SKILL"
                ],
                [
                    673,
                    682,
                    "TOOL"
                ],
                [
                    790,
                    799,
                    "TOOL"
                ],
                [
                    842,
                    850,
                    "QUALIFICATION"
                ],
                [
                    901,
                    912,
                    "SKILL"
                ],
                [
                    916,
                    922,
                    "QUALIFICATION"
                ],
                [
                    973,
                    984,
                    "SKILL"
                ],
                [
                    1056,
                    1064,
                    "SKILL"
                ],
                [
                    1065,
                    1074,
                    "QUALIFICATION"
                ],
                [
                    1116,
                    1122,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1123,
                    1134,
                    "SKILL"
                ],
                [
                    1157,
                    1168,
                    "SKILL"
                ],
                [
                    1183,
                    1186,
                    "TOOL"
                ],
                [
                    1198,
                    1210,
                    "SKILL"
                ],
                [
                    1294,
                    1303,
                    "TOOL"
                ],
                [
                    1412,
                    1423,
                    "SKILL"
                ],
                [
                    1590,
                    1599,
                    "TOOL"
                ],
                [
                    1715,
                    1723,
                    "SKILL"
                ],
                [
                    1875,
                    1880,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1897,
                    1901,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2035,
                    2040,
                    "SKILL"
                ],
                [
                    2091,
                    2094,
                    "TOOL"
                ],
                [
                    2096,
                    2102,
                    "TOOL"
                ],
                [
                    2107,
                    2112,
                    "TOOL"
                ],
                [
                    2330,
                    2339,
                    "TOOL"
                ],
                [
                    2581,
                    2586,
                    "SKILL"
                ],
                [
                    2615,
                    2618,
                    "TOOL"
                ],
                [
                    2619,
                    2632,
                    "QUALIFICATION"
                ],
                [
                    2706,
                    2714,
                    "SKILL"
                ],
                [
                    2746,
                    2759,
                    "QUALIFICATION"
                ]
            ]
        }
    ],
    [
        "An ideal candidate is intellectually curious, has a solution-oriented mindset, and enjoys learning new tools and techniques. You will have the opportunity to design and deliver the centralized and secure data exchange platform, related SDK, and related tools to collect, manage, and analyze user data from various sources for personalized and data-driven Insurance products and services. You would utilize Metering, Telemetry & Streaming Technologies to enhance risk assessment and customer engagement through real-time data collection, data store and data analysis.\n\nOur Senior Staff Engineer works with our Staff and Sr. Engineers to innovate and build new systems, improve and enhance existing systems and identify new opportunities to apply your knowledge to solve critical problems. You will lead the strategy and execution of a technical roadmap that will increase the velocity of delivering products and unlock new engineering capabilities. The ideal candidate has deep technical expertise in their domain.\n\nAs a Senior Staff Engineer, you will:\n\nFocus on multiple areas and provide technical and thought leadership to the enterprise\nCollaborate with product managers, team members, customers, and other engineering teams to solve our toughest problems\nDevelop and execute technical software development strategy for a variety of domains\nAccountable for the quality, usability, and performance of the solutions\nUtilize programming languages like Python, C# or other object-oriented languages, SQL, and NoSQL databases, Container Orchestration services including Docker and Kubernetes, and a variety of Azure tools and services\nBe a role model and mentor, helping to coach and strengthen the technical expertise and know-how of our engineering and product community\nInfluence and educate leadership at all levels\nConsistently share best practices and improve processes within and across teams\nAnalyze cost and forecast, incorporating them into business plans\nDetermine and support resource requirements, evaluate operational processes, measure outcomes to ensure desired results, and demonstrate adaptability and sponsoring continuous learning\n\nQualifications\n\nExemplary ability to design, perform experiments, and influence engineering direction and product roadmap\nExperience partnering with engineering teams and transferring research to production\nTrack-record of publications history in credible conferences and journals\nExperience with continuous delivery and infrastructure as code\nIn-depth knowledge of CS data structures and algorithms\nExperience solving analytical problems with quantitative approaches \nAbility to excel in a fast-paced, startup-like environment\nKnowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication)\nFluency and specialization with at least two modern languages such as Java, Python or C# including object-oriented design\nExperience with micro-services oriented architecture and extensible REST APIs\nExperience building the architecture and design (architecture, design patterns, reliability, and scaling) of new and current systems\nFluency in DevOps Concepts, Cloud Architecture, and Azure DevOps Operational Framework\nExperience in leveraging PowerShell scripting \nExperience in existing Operational Portals such as Azure Portal\nExperience with application monitoring tools and performance assessments \nIn depth knowledge of Datacenter structure, capabilities, and offerings, including the Azure platform, and its native services including the Azure platform and its native services\nExperience in security protocols and products: Understanding of Active Directory, Windows Authentication, SAML, OAuth\nExperience in Azure Network (Subscription, Security zoning, etc.)\nHighly proficient in architecture assessment and proposals\n\nExperience\n\n10+ years of professional software development experience within the .NET framework (C# including object-oriented design)\n8+ years of experience with architecture and design\n6+ years of experience in open-source frameworks\n4+ years of experience with AWS, GCP, Azure, or another cloud service\n\nEducation\n\nBachelor’s degree in Computer Science, Information Systems, or equivalent education or work experience\n",
        {
            "entities": [
                [
                    158,
                    164,
                    "SKILL"
                ],
                [
                    236,
                    239,
                    "SKILL"
                ],
                [
                    557,
                    565,
                    "SKILL"
                ],
                [
                    1141,
                    1152,
                    "SKILL"
                ],
                [
                    1299,
                    1310,
                    "SKILL"
                ],
                [
                    1453,
                    1459,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1461,
                    1463,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1473,
                    1488,
                    "SKILL"
                ],
                [
                    1500,
                    1503,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    1569,
                    1575,
                    "SKILL"
                ],
                [
                    1580,
                    1590,
                    "SKILL"
                ],
                [
                    1609,
                    1614,
                    "TOOL"
                ],
                [
                    1979,
                    1986,
                    "SKILL"
                ],
                [
                    2188,
                    2194,
                    "SKILL"
                ],
                [
                    2335,
                    2343,
                    "SKILL"
                ],
                [
                    2631,
                    2636,
                    "TOOL"
                ],
                [
                    2730,
                    2741,
                    "SKILL"
                ],
                [
                    2759,
                    2769,
                    "SKILL"
                ],
                [
                    2828,
                    2841,
                    "SKILL"
                ],
                [
                    2913,
                    2917,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2919,
                    2925,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2929,
                    2931,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    2942,
                    2957,
                    "SKILL"
                ],
                [
                    2958,
                    2964,
                    "SKILL"
                ],
                [
                    3005,
                    3017,
                    "SKILL"
                ],
                [
                    3067,
                    3079,
                    "SKILL"
                ],
                [
                    3084,
                    3090,
                    "SKILL"
                ],
                [
                    3092,
                    3104,
                    "SKILL"
                ],
                [
                    3106,
                    3112,
                    "SKILL"
                ],
                [
                    3204,
                    3209,
                    "SKILL"
                ],
                [
                    3210,
                    3222,
                    "SKILL"
                ],
                [
                    3228,
                    3233,
                    "TOOL"
                ],
                [
                    3361,
                    3366,
                    "TOOL"
                ],
                [
                    3535,
                    3540,
                    "TOOL"
                ],
                [
                    3589,
                    3594,
                    "TOOL"
                ],
                [
                    3642,
                    3650,
                    "SKILL"
                ],
                [
                    3710,
                    3717,
                    "TOOL"
                ],
                [
                    3718,
                    3732,
                    "SKILL"
                ],
                [
                    3734,
                    3738,
                    "SKILL"
                ],
                [
                    3740,
                    3745,
                    "SKILL"
                ],
                [
                    3760,
                    3765,
                    "TOOL"
                ],
                [
                    3789,
                    3797,
                    "SKILL"
                ],
                [
                    3833,
                    3845,
                    "SKILL"
                ],
                [
                    3919,
                    3930,
                    "SKILL"
                ],
                [
                    3953,
                    3957,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3969,
                    3971,
                    "PROGRAMMING_LANGUAGE"
                ],
                [
                    3982,
                    3997,
                    "SKILL"
                ],
                [
                    3998,
                    4004,
                    "SKILL"
                ],
                [
                    4034,
                    4046,
                    "SKILL"
                ],
                [
                    4051,
                    4057,
                    "SKILL"
                ],
                [
                    4135,
                    4138,
                    "TOOL"
                ],
                [
                    4140,
                    4143,
                    "TOOL"
                ],
                [
                    4145,
                    4150,
                    "TOOL"
                ],
                [
                    4163,
                    4168,
                    "SKILL"
                ],
                [
                    4189,
                    4197,
                    "QUALIFICATION"
                ]
            ]
        }
    ]
]